{
    "data":
        [
            {
                "semana": "1",
                "title": "Introduccion De Las Redes De Computadoras",
                "data": "Red de computadoras<br> Ir a la navegaciónIr a la búsqueda<br> Una red de computadoras (también llamada red de ordenadores o red informática) es un conjunto de equipos nodos y software conectados entre sí por medio de dispositivos físicos que envían y reciben impulsos eléctricos, ondas electromagnéticas o cualquier otro medio para el transporte de datos, con la finalidad de compartir información, recursos y ofrecer servicios.<br> <br> Como en todo proceso de comunicación, se requiere de un emisor, un mensaje, un medio y un receptor. La finalidad principal para la creación de una red de ordenadores es compartir los recursos y la información en la distancia, asegurar la confiabilidad y la disponibilidad de la información, aumentar la velocidad de transmisión de los datos y reducir el costo. Un ejemplo es Internet, el cual es una gran red de millones de ordenadores ubicados en distintos puntos del planeta interconectados básicamente para compartir información y recursos.<br> <br> La estructura y el modo de funcionamiento de las redes informáticas actuales están definidos en varios estándares, siendo el más importante y extendido de todos ellos el modelo TCP/IP utilizado como base para el modelo de referencia OSI. Este último, concibe cada red como estructurada en siete capas con funciones concretas pero relacionadas entre sí (en TCP/IP se habla de cuatro capas). Debe recordarse que el modelo de referencia OSI es una abstracción teórica, que facilita la comprensión del tema, si bien se permiten ciertos desvíos respecto a dicho modelo.<br> <br> Existen multitud de protocolos repartidos por cada capa, los cuales también están regidos por sus respectivos estándares.<br> Etimología<br> La palabra red viene del latín rete, retis, (malla de hilo para pescar). En informática es el calco del inglés net (malla), para referirse a los cables, alambres y otros conductos que sirven para la comunicación electrónica entre ordenadores.<br> <br> Historia<br> El primer indicio de redes de comunicación fue de tecnología telefónica y telegráfica. En 1940 se transmitieron datos desde la Universidad de Darmouth, en Nuevo Hampshire, a Nueva York. A finales de la década de 1960 y en los posteriores 70 fueron creados los miniordenadores. En 1976, Apple introduce el Apple I, uno de los primeros ordenadores personales. En 1981, IBM introdujo su primer PC. A mitad de la década de 1980 los PC comienzan a usar los módem para compartir archivos con otros ordenadores, en un rango de velocidades que comenzó en 1200 bps y llegó a los 56 kbps (comunicación punto a punto o dial-up), cuando empezaron a ser sustituidos por sistema de mayor velocidad, especialmente ADSL en el 1980.<br> <br> Descripción básica<br> La comunicación por medio de una red se lleva a cabo en dos diferentes categorías: la capa física y la capa lógica.<br> <br> La capa física incluye todos los elementos de los que hace uso un equipo para comunicarse con otros equipos dentro de la red, como, por ejemplo, las tarjetas de red, los cables, las antenas, etc. Pertenecen a la capa física las características materiales (componentes y conectores mecánicos) y eléctricas (niveles de tensión) que se van a usar en la transmisión de los datos por los medios físicos, y en su correspondiente recepción.<br> <br> La comunicación a través de la capa lógica se rige por normas muy rudimentarias que por sí mismas resultan de escasa utilidad. Sin embargo, haciendo uso de dichas normas es posible construir los denominados protocolos, que son normas de comunicación más complejas (mejor conocidas como de alto nivel), capaces de proporcionar servicios que resultan útiles.<br> <br> Los protocolos son un concepto muy similar al de los idiomas de las personas. Si dos personas hablan el mismo idioma, y respetan ciertas reglas (tales como hablar y escucharse por turnos), es posible comunicarse y transmitir ideas/ información.<br> <br> La razón más importante (quizá la única) sobre por qué existe diferenciación entre la capa física y la lógica es sencilla: cuando existe una división entre ambas, es posible utilizar un número casi infinito de protocolos distintos, lo que facilita la actualización y migración entre distintas tecnologías.<br>"
            },
            {
                "semana": "2",
                "title": "Clasificacion de Redes",
                "data": "Personal Area Network (PAN)<br> Para llevar a cabo un intercambio de datos, los terminales modernos como smartphones, tablets, ordenadores portátiles o equipos de escritorio permiten asociarse ad hoc a una red. Esto puede realizarse por cable y adoptar la forma de una Personal Area Network (PAN) o red de área personal, aunque las técnicas de transmisión más habituales son la memoria USB o el conector FireWire. La variante inalámbrica Wireless Personal Area Network (WPAN) se basa en técnicas como Bluetooth, Wireless USB, Insteon, IrDA, ZigBee o Z-Wave. Una Personal Area Network inalámbrica que se lleva a cabo vía Bluetooth recibe el nombre de Piconet. El ámbito de acción de las redes PAN y WPAN se limita normalmente a unos pocos metros y, por lo tanto, no son aptas para establecer la conexión con dispositivos que se encuentran en habitaciones o edificios diferentes.<br> <br> Además de establecer la comunicación entre cada uno de los dispositivos entre sí, las redes de área personal (Personal Area Networks) permiten, asimismo, la conexión con otras redes de mayor tamaño. En este caso se puede hablar de un uplink o de un enlace o conexión de subida. Debido al alcance limitado y a una tasa de transmisión de datos relativamente baja, las PAN se utilizan principalmente para conectar periféricos en el ámbito del ocio y de los hobbies. Algunos ejemplos típicos son los auriculares inalámbricos, las videoconsolas y las cámaras digitales. En el marco del Internet of Things (IoT),las redes WPAN se utilizan para la comunicación de las aplicaciones de control y monitorización con una frecuencia de transferencia baja. A este respecto, los protocolos como Insteon, Z-Wave y ZigBee han sido diseñados especialmente para la domótica y para la automatización del hogar.<br> <br> Local Area Network (LAN)<br> Si una red está formada por más de un ordenador, esta recibe el nombre de Local Area Network (LAN). Una red local de tales características puede incluir a dos ordenadores en una vivienda privada o a varios miles de dispositivos en una empresa. Asimismo, las redes en instituciones públicas como administraciones, colegios o universidades también son redes LAN. Un estándar muy frecuente para redes de área local por cable es Ethernet. Otras opciones menos comunes y algo obsoletas son las tecnologías de red ARCNET, FDDI y Token Ring. La transmisión de datos tiene lugar o bien de manera electrónica a través de cables de cobre o mediante fibra óptica de vidrio.<br> <br> Si se conectan más de dos ordenadores en una red LAN, se necesitan otros componentes de red como hubs, bridges y switches, es decir, concentradores, puentes de red y conmutadores, los cuales funcionan como elementos de acoplamiento y nodos de distribución. El tipo de red conocido como LAN o red de área local fue desarrollado para posibilitar la rápida transmisión de cantidades de datos más grandes. En función de la estructura de la red y del medio de transmisión utilizado se puede hablar de un rendimiento de 10 a 1.000 Mbit/s. Asimismo, las redes LAN permiten un intercambio de información cómodo entre los diversos dispositivos conectados a la red. Por ello, en el entorno empresarial es habitual que varios equipos de trabajo puedan acceder a servidores de archivos comunes, a impresoras de red o a aplicaciones por medio de la red LAN.<br> <br> Si la red local tiene lugar de manera inalámbrica, se puede hablar en este caso de una Wireless Local Area Network (WLAN) o red de área local inalámbrica y los fundamentos básicos de los estándares de la red WLAN quedan definidos por la familia de normas IEEE 802.11. Las redes locales inalámbricas ofrecen la posibilidad de integrar terminales cómodamente en una red doméstica o empresarial y son compatibles con redes LAN Ethernet, aunque el rendimiento es, en este caso, algo menor que el de una conexión Ethernet.<br> <br> El alcance de una Local Area Network depende tanto del estándar usado como del medio de transmisión y aumenta a través de un amplificador de señal que recibe el nombre de repetidor (repeater). En el caso de la ampliación Gigabit Ethernet por medio de fibra de vidrio, se puede llegar a un alcance de señal de varios kilómetros. No resulta muy habitual, sin embargo, que las Local Area Networks estén formadas por más de una estructura. El grupo de redes LAN geográficamente cercanas puede asociarse a una Metropolitan Area Network (MAN) o Wide Area Network (WAN) superiores.<br> <br> Local Area Network<br> SilverStar – Sample Network Diagram via Wikimedia Commons, CC BY-SA 3.0<br> <br> Metropolitan Area Network (MAN)<br> La Metropolitan Area Network (MAN) o red de área metropolitana es una red de telecomunicaciones de banda ancha que comunica varias redes LAN en una zona geográficamente cercana. Por lo general, se trata de cada una de las sedes de una empresa que se agrupan en una MAN por medio de líneas arrendadas. Para ello, entran en acción routers de alto rendimiento basados en fibra de vidrio, los cuales permiten un rendimiento mayor al de Internet y la velocidad de transmisión entre dos puntos de unión distantes es comparable a la comunicación que tiene lugar en una red LAN.<br> <br> Los operadores que desempeñan actividades internacionales son los encargados de poner a disposición la infraestructura de las redes MAN. De esta manera, las ciudades conectadas mediante Metropolitan Area Networks pueden contar a nivel suprarregional con Wide Area Networks (WAN) y a nivel internacional con Global Area Networks (GAN).<br> <br> Para una red MAN, la red Metro Ethernet supone una técnica especial de transmisión con la que se pueden construir redes MEN (Metro Ethernet Network) sobre la base de Carrier Ethernet (CE 1.0) o Carrier Ethernet 2.0 (CE 2.0).<br> <br> El estándar para redes inalámbricas regionales de mayor envergadura, es decir, las denominadas Wireless Metropolitan Area Networks (WMAN), fue desarrollado con IEEE 802.16. Esta tecnología de WiMAX (Worldwide Interoperability for Microwave Access) permite crear las llamadas redes WLAN hotzones, que consisten en varios puntos de acceso WLAN interconectados en diferentes localizaciones. Las redes WMAN se utilizan para ofrecer a los usuarios una potente conexión a Internet en aquellas regiones que carecen de infraestructura para ello, y es que el DSL, el estándar habitual de transmisión, solo está disponible técnicamente donde hay hilos de cobre.<br> <br> Wide Area Network (WAN)<br> Mientras que las redes Metropolitan Area Networks comunican puntos que se encuentran cerca unos de los otros en regiones rurales o en zonas de aglomeraciones urbanas, las Wide Area Networks (WAN) o redes de área amplia se extienden por zonas geográficas como países o continentes. El número de redes locales o terminales individuales que forman parte de una WAN es, en principio, ilimitado.<br> <br> Mientras que las redes LAN y las MAN pueden establecerse a causa de la cercanía geográfica del ordenador o red que se tiene que conectar en base a Ethernet, en el caso de las Wide Area Networks entran en juego técnicas como IP/MPLS (Multiprotocol Label Switching), PDH (Plesiochronous Digital Hierarchy), SDH (Synchronous Digital Hierarchy), SONET (Synchronous Optical Network), ATM (Asynchronous Transfer Mode) y, rara vez, el estándar obsoleto X.25.<br> <br> En la mayoría de los casos, las Wide Area Networks suelen pertenecer a una organización determinada o a una empresa y se gestionan o alquilan de manera privada. Los proveedores de servicios de Internet también hacen uso de este tipo de redes para conectar las redes corporativas locales y a los consumidores a Internet.<br> <br> Wide Area Network (WAN)<br> Harald Mühlböck – Gateway Firewall via Wikimedia Commons, CC BY-SA 3.0<br> <br> Global Area Network (GAN)<br> Una red global como Internet recibe el nombre de Global Area Network (GAN), sin embargo no es la única red de ordenadores de esta índole. Las empresas que también son activas a nivel internacional mantienen redes aisladas que comprenden varias redes WAN y que logran, así, la comunicación entre los ordenadores de las empresas a nivel mundial. Las redes GAN utilizan la infraestructura de fibra de vidrio de las redes de área amplia (Wide Area Networks) y las agrupan mediante cables submarinos internacionales o transmisión por satélite.<br> <br> Virtual Private Network (VPN)<br> Una red privada virtual (VPN) es una red de comunicación virtual que utiliza la infraestructura de una red física para asociar sistemas informáticos de manera lógica. En este sentido, se puede tratar de todos los tipos de redes expuestos anteriormente. Lo más común es utilizar Internet como medio de transporte, ya que este permite establecer la conexión entre todos los ordenadores a nivel mundial y, al contrario de lo que ocurre con las redes MAN o WAN privadas, está disponible de forma gratuita. La transferencia de datos tiene lugar dentro de un túnel virtual erigido entre un cliente VPN y un servidor VPN.<br> <br> Si se utiliza la red pública como medio de transporte, las Virtual Private Networks o redes privadas virtuales suelen cifrarse para garantizar la confidencialidad de los datos. Las VPN se emplean para conectar redes LAN en Internet o para hacer posible el acceso remoto a una red o a un único ordenador a través de la conexión pública.<br>"
            },
            {
                "semana": "3",
                "title": "Topologias De Redes",
                "data": "Una topología de red es la disposición de una red, incluyendo sus nodos y líneas de conexión. Hay dos formas de definir la geometría de la red: la topología física y la topología lógica (o de señal).<br> <br> La topología física de una red es la disposición geométrica real de las estaciones de trabajo. Existen varias topologías físicas comunes, como se describe a continuación y como se muestra en la ilustración.<br> <br> Tipos de topologías físicas de red<br> En la topología de la red de bus, cada estación de trabajo está conectada a un cable principal llamado bus. Por lo tanto, en efecto, cada estación de trabajo está conectada directamente a cada otra estación de trabajo de la red.<br> <br> En la topología de red en estrella, hay un ordenador central o servidor al que todas las estaciones de trabajo están conectadas directamente. Cada estación de trabajo está indirectamente conectada entre sí a través de la computadora central.<br> <br> En la topología de red en anillo, las estaciones de trabajo están conectadas en una configuración de bucle cerrado. Los pares de estaciones de trabajo adyacentes están conectados directamente. Otros pares de estaciones de trabajo están indirectamente conectados, pasando los datos a través de uno o más nodos intermedios.<br> <br> Si se utiliza un protocolo Token Ring en una topología en estrella o en anillo, la señal viaja en una sola dirección, llevada por un denominado token de nodo a nodo.<br> <br> La topología de red de malla (mesh) emplea cualquiera de dos esquemas, llamados malla completa y malla parcial. En la topología de malla completa, cada estación de trabajo está conectada directamente a cada uno de los otros. En la topología de malla parcial, algunas estaciones de trabajo están conectadas a todas las demás, y algunas están conectadas sólo a los otros nodos con los que intercambian más datos.<br> <br> La topología de red de árbol utiliza dos o más redes en estrella conectadas entre sí. Los ordenadores centrales de las redes en estrella están conectados a un bus principal. Así, una red de árboles es una red de buses de redes estrella.<br> <br> La topología lógica (o de señal) se refiere a la naturaleza de los caminos que siguen las señales de nodo a nodo. En muchos casos, la topología lógica es la misma que la topología física. Pero no siempre es así. Por ejemplo, algunas redes se disponen físicamente en una configuración en estrella, pero funcionan lógicamente como redes de bus o de anillo.<br>"
            },
            {
                "semana": "4",
                "title": "Modelo De Referencia OSI",
                "data": "Es un estándar desarrollado en 1980 por la ISO,1​ una federación global de organizaciones que representa aproximadamente a 160 países. El núcleo de este estándar es el modelo de referencia OSI, una normativa formada por siete capas que define las diferentes fases por las que deben pasar los datos para viajar de un dispositivo a otro sobre una red de comunicaciones.<br> <br> Siguiendo el esquema de este modelo se crearon numerosos protocolos. El advenimiento de protocolos más flexibles donde las capas no están tan desmarcadas y la correspondencia con los niveles no era tan clara puso a este esquema en un segundo plano. Sin embargo se usa en la enseñanza como una manera de mostrar cómo puede estructurarse una «pila» de protocolos de comunicaciones.4​<br> <br> El modelo especifica el protocolo que debe usarse en cada capa, y suele hablarse de modelo de referencia ya que se usa como una gran herramienta para la enseñanza de comunicación de redes.<br> <br> Debe recordarse siempre que es un modelo, una construcción teórica, por ende no tiene un correlato directo con el mundo real. Se trata de una normativa estandarizada útil debido a la existencia de muchas tecnologías, fabricantes y compañías dentro del mundo de las comunicaciones, y al estar en continua expansión, se tuvo que crear un método para que todos pudieran entenderse de algún modo, incluso cuando las tecnologías no coincidieran. De este modo, no importa la localización geográfica o el lenguaje utilizado- todo el mundo debe atenerse a unas normas mínimas para poder comunicarse entre sí. Esto es sobre todo importante cuando hablamos de la red de redes, es decir, Internet.<br> <br> El modelo es el modelo de red descriptivo, que fue creado por la Organización internacional para la Estandarización en el año 1980. Reconoció que era necesario crear un modelo de red que pudiera ayudar a los diseñadores de red a implementar redes que pudieran comunicarse y trabajar en conjunto y por lo tanto, elaboraron el modelo de referencia OSI. El núcleo de este estándar es el modelo de referencia OSI, una normativa formada por siete capas que define las diferentes fases por las que deben pasar los datos para viajar de un dispositivo a otro sobre una red de comunicaciones. El modelo especifica el protocolo que debe ser usado en cada capa, y suele hablarse de modelo de referencia ya que es usado como una gran herramienta para la enseñanza de comunicación de redes.<br> <br> Existen diversos protocolos de acuerdo a cómo se espera que sea la comunicación. Este conjunto de protocolos se denomina TCP/IP. TCP/IP se ha convertido en el estándar de-facto para la conexión en red corporativa. Las redes TCP/IP son ampliamente escalables, para lo que TCP/IP puede utilizarse tanto para redes pequeñas como grandes.<br> <br> TCP/IP es un conjunto de protocolos encaminados que puede ejecutarse en distintas plataformas de software y casi todos los sistemas operativos de red lo soportan como protocolo de red predeterminado. Protocolos miembro de la pila TCP/IP. FTP, SMTP, UDP, IP, ARP. TCP corre en varias capas del modelo OSI Protocolo de Internet. Es un protocolo no orientado a conexión usado tanto por el origen como por el destino para la comunicación de datos a través de una red de paquetes conmutados. Los datos en una red basada en IP son enviados en bloques conocidos como paquetes o datagramas.<br> <br> Capas del Modelo OSI<br> Número Nombre Responsabilidad Descripción<br> Capa 7 Aplicación Responsable de los servicios de red para las aplicaciones Difiere de las demás capas debido a que no proporciona servicios a ninguna otra capa OSI, sino solamente a aplicaciones que se encuentran fuera del modelo OSI. La capa de aplicación establece la disponibilidad de los potenciales socios de comunicación, sincroniza y establece acuerdos sobre los procedimientos de recuperación de errores y control de la integridad de los datos. Esta garantiza que la información que envía la capa de aplicación de un sistema pueda ser leída por la capa de aplicación de otro. De ser necesario, la capa de presentación traduce entre varios formatos de datos utilizando un formato común.<br> Capa 6 Presentación Transforma el formato de los datos y proporciona una interfaz estándar para la capa de aplicación Su objetivo es encargarse de la representación de la información, de manera que aunque distintos equipos puedan tener diferentes representaciones internas de caracteres números, sonido o imágenes, los datos lleguen de manera reconocibles. Esta capa es la primera en trabajar más el contenido de la comunicación que en como se establece la misma. En ella se tratan aspectos tales como la semántica y la sintaxis de los datos transmitidos, ya que distintas computadoras pueden tener diferentes formas de manejarlas. Por lo tanto, podemos resumir definiendo a esta capa como la encargada de manejar las estructuras de datos abstractas y realizar las conversiones de representación de datos necesarias para la correcta interpretación de los mismos.<br> Capa 5 Sesión Establece, administra y finaliza las conexiones entre las aplicaciones locales y las remotas Esta capa también permite cifrar los datos y comprimirlos. Como su nombre lo implica, la capa de sesión establece, administra y finaliza las sesiones entre dos hosts que se están comunicando. La capa de sesión proporciona sus servicios a la capa de presentación. También sincroniza el diálogo entre las capas de presentación de los dos hosts y administra su intercambio de datos.<br> Además de regular la sesión, la capa de sesión ofrece disposiciones para una eficiente transferencia de datos, clase de servicio y un registro de excepciones acerca de los problemas de la capa de sesión, presentación y aplicación. Pero este protocolo debe transportarse entre máquinas a través de otros protocolos. Con SAP, los servidores permiten a los enrutadores crear y mantener una base de datos con la información actualizada de los servidores de la interred. La capa de transporte segmenta los datos originados en el host emisor y los reensambla en una corriente de datos dentro del sistema del host receptor.<br> <br> Capa 4 Transporte Proporciona transporte confiable y control del flujo a través de la red El límite entre la capa de transporte y la capa de sesión puede imaginarse como el límite entre los protocolos de aplicación y los protocolos de flujo de datos. Mientras que las capas de aplicación, presentación y sesión están relacionadas con asuntos de aplicaciones, las cuatro capas inferiores se encargan del transporte de datos. TCP crea conexiones a través de las cuales puede enviar flujos de datos. El protocolo garantiza que los datos serán entregados en su destino sin errores y en el mismo orden en que se transmitieron.<br> Capa 3 Red Responsable del direccionamiento lógico y el dominio del enrutamiento Su misión es conseguir que los datos lleguen desde el origen al destino aunque no tengan conexión directa. IPX/SPX Es una familia de protocolos de red desarrollados por novell y utilizado por su sistema operativo de red netware. El IPX Es un protocolo de datagramas rápido orientados a comunicaciones sin conexión que se encarga de transmitir datos a través de la red, incluyendo en cada paquete la dirección de destino. La capa de enlace de datos proporciona tránsito de datos confiable a través de un enlace físico.<br> Capa 2 Enlace de Datos Proporciona direccionamiento físico y procedimientos de acceso a medios Al hacerlo, la capa de enlace de datos se ocupa del direccionamiento físico, la topología de red, el acceso a la red, la notificación de errores, entrega ordenada de tramas y control de flujo. Ethernet define las características de cableado y señalización de nivel físico y los formatos de tramas de datos del nivel de enlace de datos. FDDI Proporciona un 100 Mbits/s óptico estándar para la transmisión de datos en una red de área local.<br> Capa 1 Física Define todas las especificaciones eléctricas y físicas de los dispositivos. La capa física define las especificaciones eléctricas, mecánicas, de procedimiento y funcionales para activar, mantener y desactivar el enlace físico entre sistemas finales.<br> Las características tales como niveles de voltaje, temporización de cambios de voltaje, velocidad de datos físicos, distancias de transmisión máximas, conectores físicos y otros atributos similares son definidos por las especificaciones de la capa física. Bluetooth es una especificación industrial para Redes Inalámbricas de Área Personal que posibilita la transmisión de voz y datos entre diferentes dispositivos. ADSL Consiste en una transmisión analógica de datos digitales apoyado en el par simétrico de cobre que lleva la línea telefónica convencional. USB Es un estándar industrial desarrollado en los años 1990 que define los cables, conectores y protocolos usados en un bus para conectar , comunicar y proveer de alimentación eléctrica entre ordenadores, periféricos y dispositivos electrónicos.<br> <br> Consiste en una transmisión analógica de datos digitales apoyada en el par simétrico de cobre que lleva la línea telefónica convencional.<br> <br> Capa física - Capa 1<br> Artículo principal: Capa física<br> Es la capa más baja del modelo OSI. Es la que se encarga de la topología de red y de las conexiones globales de la computadora hacia la red, se refiere tanto al medio físico como a la forma en la que se transmite la información y de las redes.6​<br> <br> Sus principales funciones se pueden resumir como:<br> <br> Definir el medio o medios físicos por los que va a viajar la comunicación: cable de pares trenzados (o no, como en RS232/EIA232), cable coaxial, guías de onda, aire, fibra óptica.<br> Definir las características materiales (componentes y conectores mecánicos) y eléctricas (niveles de tensión) que se van a usar en la transmisión de los datos por los medios físicos.<br> Definir las características funcionales de la interfaz (establecimiento, mantenimiento y liberación del enlace físico).<br> Transmitir el flujo de bits a través del medio.<br> Manejar las señales eléctricas del medio de transmisión, polos en un enchufe, etc.<br> Garantizar la conexión (aunque no la fiabilidad de dicha conexión).<br> Capa de enlace de datos - Capa 2<br> Artículo principal: Capa de enlace de datos<br> Esta capa se ocupa del direccionamiento físico, del acceso al medio, de la detección de errores, de la distribución ordenada de tramas y del control del flujo.7​<br> <br> Es uno de los aspectos más importantes que revisar en el momento de conectar dos ordenadores, ya que está entre la capa 1 y 3 como parte esencial para la creación de sus protocolos básicos (MAC, IP), para regular la forma de la conexión entre computadoras, determinando el paso de tramas (unidad de medida de la información en esta capa, que no es más que la segmentación de los datos trasladándolos por medio de paquetes), verificando su integridad, y corrigiendo errores.<br> <br> Por lo cual es importante mantener una excelente adecuación al medio físico (los más usados son el cable UTP, par trenzado o de 8 hilos), con el medio de red que redirige las conexiones mediante un enrutador.<br> <br> Dadas estas situaciones cabe recalcar que el dispositivo que usa la capa de enlace es el Switch que se encarga de recibir los datos del enrutador y enviar cada uno de estos a sus respectivos destinatarios (servidor -> computador cliente o algún otro dispositivo que reciba información como teléfonos móviles, tabletas y diferentes dispositivos con acceso a la red, etc.), dada esta situación se determina como el medio que se encarga de la corrección de errores, manejo de tramas, protocolización de datos (se llaman protocolos a las \"reglas de cortesía\" o convenciones que debe seguir cualquier capa del modelo OSI).<br> <br> Capa de red - Capa 3<br> Artículo principal: Capa de red<br> Se encarga de identificar el enrutamiento existente entre una o más redes. Las unidades de datos se denominan paquetes, y se pueden clasificar en protocolos enrutables y protocolos de enrutamiento.8​<br> <br> Enrutables: viajan con los paquetes (IP, IPX, APPLETALK)<br> Enrutamiento: permiten seleccionar las rutas (RIP, IGRP, EIGRP, OSPF, BGP)<br> El objetivo de la capa de red es hacer que los datos lleguen desde el origen al destino, aun cuando ambos no estén conectados directamente sino que utilicen dispositivos intermedios. Los dispositivos que facilitan tal tarea se denominan encaminadores o enrutadores, aunque es más frecuente encontrarlo con el nombre en inglés routers. Los routers trabajan en esta capa, aunque pueden actuar como switch de nivel 2 en determinados casos, dependiendo de la función que se le asigne. Los firewalls actúan sobre esta capa principalmente, para descartar direcciones de determinadas máquinas o limitar el acceso a ciertas de ellas.<br> <br> En este nivel se realiza el direccionamiento lógico y la determinación de la ruta de los datos hasta su receptor final.<br> <br> Capa de transporte - Capa 4<br> Artículo principal: Capa de transporte<br> Capa encargada de efectuar el transporte de los datos (que se encuentran dentro del paquete) de la máquina origen a la de destino, independientemente del tipo de red física que esté utilizando.9​<br> <br> La PDU (unidad de información) de la capa 4 se llama Segmento o Datagrama, dependiendo de si corresponde a TCP o UDP, el primero orientado a conexión (transmisión verificada, eventualmente retransmitida) y el otro sin conexión (pueden perderse algunos datos por el camino).10​ Trabajan, por lo tanto, con puertos lógicos y junto con la capa red dan forma a los conocidos como Sockets IP:Puerto (ejemplo: 191.16.200.54:80).<br> <br> Capa de sesión - Capa 5<br> Artículo principal: Capa de sesión<br> Esta capa es la que se encarga de mantener y controlar el enlace establecido entre dos computadores que están transmitiendo datos de cualquier índole. Por lo tanto, el servicio provisto por esta capa es la capacidad de asegurar que, dada una sesión establecida entre dos máquinas, la misma se pueda efectuar para las operaciones definidas de principio a fin, reanudándolas en caso de interrupción.11​ En muchos casos, los servicios de la capa de sesión son parcial o totalmente prescindibles.<br> <br> Capa de presentación - Capa 6<br> Artículo principal: Capa de presentación<br> El objetivo es encargarse de la representación de la información, de manera que, aunque distintos equipos puedan tener diferentes representaciones internas de caracteres, los datos lleguen de manera reconocible.12​<br> <br> Esta capa es la primera en trabajar más el contenido de la comunicación que el cómo se establece la misma. En ella se tratan aspectos tales como la semántica y la sintaxis de los datos transmitidos, ya que distintas computadoras pueden tener diferentes formas de manejarlas. Por ejemplo, un mismo sitio web puede adecuar la presentación de sus datos según se acceda desde un computador convencional, una tableta, o un teléfono inteligente.<br> <br> Esta capa también permite cifrar los datos y comprimirlos. Por lo tanto, podría decirse que esta capa actúa como un traductor.<br> <br> Capa de aplicación - Capa 7<br> Artículo principal: Capa de aplicación<br> Ofrece a las aplicaciones la posibilidad de acceder a los servicios de las demás capas y define los protocolos que utilizan las aplicaciones para intercambiar datos, como correo electrónico (Post Office Protocol y SMTP), gestores de bases de datos y servidor de ficheros (FTP). Hay tantos protocolos como aplicaciones distintas y puesto que continuamente se desarrollan nuevas aplicaciones el número de protocolos crece sin parar.13​<br> <br> Cabe aclarar que el usuario normalmente no interactúa directamente con el nivel de aplicación. Suele interactuar con programas que a su vez interactúan con el nivel de aplicación pero ocultando la complejidad subyacente.<br>"
            },
            {
                "semana": "5",
                "title": "TCP/IP",
                "data": "El modelo TCP/IP es una explicacion de protocolos de red creado por Vinton Cerf y Robert E. Kahn, en la década de 1970. Fue implantado en la red ARPANET, la primera red de área amplia (WAN), desarrollada por encargo de DARPA, una agencia del Departamento de Defensa de los Estados Unidos, y predecesora de Internet; por esta razón, a veces también se le llama modelo DoD o modelo DARPA.<br> <br> El modelo TCP/IP es usado para comunicaciones en redes y, como todo protocolo, describe un conjunto de guías generales de operación para permitir que un equipo pueda comunicarse en una red. TCP/IP provee conectividad de extremo a extremo especificando cómo los datos deberían ser formateados, direccionados, transmitidos, enrutados y recibidos por el destinatario.<br> <br> El modelo TCP/IP y los protocolos relacionados son mantenidos por la Internet Engineering Task Force.<br> <br> Para conseguir un intercambio fiable de datos entre dos equipos, se deben llevar a cabo muchos procedimientos separados. El resultado es que el software de comunicaciones es complejo. Con un modelo en capas o niveles resulta más sencillo agrupar funciones relacionadas e implementar el software modular de comunicaciones.<br> <br> Las capas están jerarquizadas. Cada capa se construye sobre su predecesora. El número de capas y, en cada una de ellas, sus servicios y funciones son variables con cada tipo de red. Sin embargo, en cualquier red, la misión de cada capa es proveer servicios a las capas superiores haciéndoles transparentes el modo en que esos servicios se llevan a cabo. De esta manera, cada capa debe ocuparse exclusivamente de su nivel inmediatamente inferior, a quien solicita servicios, y del nivel inmediatamente superior, a quien devuelve resultados.<br> <br> En qué consiste<br> TCP/IP es un conjunto de protocolos que permiten la comunicación entre los ordenadores pertenecientes a una red. La sigla TCP/IP significa Protocolo de control de transmisión/Protocolo de Internet. Proviene de los nombres de dos protocolos importantes incluidos en el conjunto TCP/IP, es decir, del protocolo TCP y del protocolo IP.<br> <br> Capas del modelo TCP/IP<br> El modelo incluye cuatro capas:<br> <br> Capa 4 o capa de aplicación.<br> Capa 3 o capa de transporte.<br> Capa 2 o capa de internet.<br> Capa 1 o capa de acceso al medio.<br> Relación con el modelo OSI<br> Varios años después del modelo DoD, el modelo OSI fue desarrollado por la Organización Internacional de Estandarización (ISO). La estructura es similar a la del modelo DoD, pero distribuida en siete capas en lugar de solo cuatro. Aunque el modelo del DoD había demostrado su idoneidad en la práctica, las grandes empresas informáticas consideraron la posibilidad de utilizar el modelo OSI para sus propios protocolos de transmisión. Desde 1988, incluso el gobierno de los Estados Unidos, incluido el Departamento de Defensa (DoD), ha apoyado el nuevo modelo. Así, el modelo OSI finalmente prevaleció. Sin embargo, el modelo del DoD se sigue utilizando a menudo para describir los procesos de comunicación en Internet. Para ello es necesario combinar algunas capas del modelo OSI:1​<br>"
            },
            {
                "semana": "7",
                "title": "Transmision De Datos",
                "data": "Transmisión analógica: estas señales se caracterizan por el continuo cambio de amplitud de la señal. En ingeniería de control de procesos la señal oscila entre 4 y 20 mA, y es transmitida en forma puramente analógica. En una señal analógica el contenido de información es muy restringido; tan solo el valor de la corriente y la presencia o no de esta puede ser determinado.<br> <br> Transmisión digital: estas señales no cambian continuamente, sino que es transmitida en paquetes discretos. No es tampoco inmediatamente interpretada, sino que debe ser primero decodificada por el receptor. El método de transmisión también es otro: como pulsos eléctricos que varían entre dos niveles distintos de voltaje. En lo que respecta a la ingeniería de procesos, no existe limitación en cuanto al contenido de la señal y cualquier información adicional.<br> <br> Medios de transmisión industrial<br> Lo que se busca en la comunicación industrial, es mayor información transmitida a mayor velocidad de transmisión. Por lo que la demanda de mejores características para los medios de transmisión es mayor. Esto es particularmente cierto para las redes industriales de comunicación, en donde las condiciones distan mucho de ser ideales debido a las posibles interferencias de máquinas eléctricas y otros. Por esta razón el mejor medio de transmisión depende mucho de la aplicación .<br> <br> Algunos de los más habituales medios de transmisión son:<br> <br> cables trenzados;<br> cables coaxiales;<br> fibra óptica.<br> Modos de transmisión<br> Transmisión paralela: es el envío de datos de byte en byte, sobre un mínimo de ocho líneas paralelas a través de una interfaz paralela, por ejemplo la interfaz paralela Centronics para impresoras.<br> <br> Transmisión en serie: es el envío de datos bit a bit sobre una interfaz serie.<br> <br> Interfaz física industrial<br> Para elegir una interfaz física se toma en cuenta la confiabilidad de transmisión y los costos, por lo tanto a pesar de las altas velocidades de transmisión que se puede obtener con una interfaz paralela, su instalación es muy costosa. Por esta razón la interfaz estándar para el campo industrial es la serie. Los bajos costos de la instalación, líneas más largas y transmisión más segura, compensan las menores velocidades de transmisión.<br> <br> Algunas interfaces tipo serie que se pueden encontrar en el campo industrial son RS-232 y RS-485, si bien existen otras.<br> <br> Interfaz RS-232C<br> Artículo principal: RS-232<br> Eléctricamente el sistema está basado en pulsos positivos y negativos de 12 voltios, en los cuales los datos son codificados sobre cable multifilar.<br> <br> Mecánicamente este estándar tiene conectores de 9 a 25 pines, las señales principales que llevan a los datos de un terminal a otro son líneas de Transmit Data y Receive Data, para ser posible la transmisión, se requiere una tercera línea que lleva el potencial común de referencia, el resto de líneas no son imprescindibles, pero llevan información del estado de los terminales de comunicación.<br> <br> Interfaz RS-485<br> Artículo principal: RS-485<br> Esta interfaz permite que actúen hasta 32 dispositivos en calidad de transmisores o receptores, los cuales pueden ser conectados a un cable de dos hilos, es decir a una verdadera operación de bus. El direccionamiento y respuesta a los comandos debe ser resuelta por el software. La máxima longitud de las líneas de transmisión para esta interfaz varia entre 1200 metros a una velocidad de 93,75 kb/s hasta 2000 metros a una velocidad de 500 kbps.<br> <br> Esta interfaz usa tres estados lógicos '0', '1' y non-Data, esta última es usada para el control o sincronización del flujo de datos; esta interfaz es encontrada con frecuencia en el campo industrial. Al utilizar pares de cables trenzados y blindados, se asegura una comunicación confiable y económica.<br>"
            },
            {
                "semana": "8",
                "title": "Medios De Transmision",
                "data": "Los medios de transmisión son las vías por las cuales se comunican los datos. Dependiendo de la forma de conducir la señal a través del medio o soporte físico, se pueden clasificar en dos grandes grupos:<br> <br> medios de transmisión guiados o alámbricos.<br> medios de transmisión no guiados o inalámbricos.<br> Las tecnologías actuales de transmisión usan ondas electromagnéticas o pulsos de luz. En el caso de los medios guiados los datos se conducen a través de cables o “alambres”. En los medios inalámbricos, se utiliza el aire como medio de transmisión, a través de radiofrecuencias, microondas y luz (infrarrojos, láser); por ejemplo: puerto IrDA (Infrared Data Association), Bluetooth o Wi-Fi.<br> <br> Según el sentido de la transmisión, existen tres tipos diferentes de medios de transmisión:<br> <br> símplex.<br> semi-dúplex (half-duplex).<br> dúplex o dúplex completo (full-duplex).<br> También los medios de transmisión se caracterizan por utilizarse en rangos de frecuencia de trabajo diferentes.<br> <br> Los medios de transmisión guiados están constituidos por cables que se encargan de la conducción (o guiado) de las señales desde un extremo al otro. Las principales características de los medios guiados son el tipo de conductor utilizado, la velocidad máxima de transmisión, las distancias máximas que puede ofrecer entre repetidores, la inmunidad frente a interferencias electromagnéticas, la facilidad de instalación y la capacidad de soportar diferentes tecnologías de nivel de enlace. La velocidad de transmisión depende directamente de la distancia entre los terminales, y de si el medio se utiliza para realizar un enlace punto a punto o un enlace multipunto. Debido a esto, los diferentes medios de transmisión tendrán diferentes velocidades de conexión que se adaptarán a utilizaciones dispares.<br> <br> Dentro de los medios de transmisión guiados, los más utilizados en el campo de las telecomunicaciones y la ínter conexión de computadoras son tres:<br> <br> cable de par trenzado<br> cable coaxial<br> fibra óptica<br> <br> Cable de par trenzado<br> Artículo principal: Cable de par trenzado<br> El cable de par trenzado consiste en un conjunto de pares de hilos de cobre conductores, cruzados entre sí, con el objetivo de reducir el ruido de diafonía. A mayor número de cruces por unidad de longitud, mejor comportamiento ante el problema de diafonía. Existen dos tipos básicos de pares trenzados:<br> <br> apantallado, blindado o con blindaje: Shielded Twisted Pair (STP).<br> no apantallado, sin blindar o sin blindaje: Unshielded Twisted Pair (UTP), es un tipo de cables de pares trenzados sin recubrimiento metálico externo, de modo que es sensible a las interferencias. Es importante guardar la numeración de los pares, ya que de lo contrario el efecto del trenzado no será eficaz, disminuyendo sensiblemente o incluso impidiendo la capacidad de transmisión. Es un cable económico, flexible y sencillo de instalar. Las aplicaciones principales en las que se hace uso de cables UTP son:<br> Bucle de abonado: es el último tramo de cable existente entre el teléfono de un abonado y la central a la que se encuentra conectado. Este cable suele ser UTP Cat 3 y en la actualidad es uno de los medios más utilizados para transporte de banda ancha, debido a que es una infraestructura que esta implantada en el 100 % de las ciudades.<br> Red de área local (LAN): en este caso se emplea UTP Cat 5 o Cat 6 para transmisión de datos, consiguiendo velocidades de varios centenares de Mbps. Un ejemplo de este uso lo constituyen las redes 10/100/1000Base-T.<br> Cable coaxial<br> Artículo principal: Cable coaxial<br> El cable coaxial Conductor central rodeado por una capa conductora cilíndrica. Se emplea en sistemas troncales o de largo alcance que portan señales múltiples con gran número de canales.<br> <br> Fibra óptica<br> Artículo principal: Fibra óptica<br> La fibra óptica es un enlace hecho con un hilo muy fino de material transparente de pequeño diámetro y recubierto de un material opaco que evita que la luz se disipe. Por el núcleo, generalmente de vidrio o plásticos, se envían pulsos de luz, no eléctricos. Hay dos tipos de fibra óptica: la multimodo y la monomodo. En la fibra multimodo la luz puede circular por más de un camino pues el diámetro del núcleo es de aproximadamente 50 µm. Por el contrario, en la fibra monomodo sólo se propaga un modo de luz, la luz sólo viaja por un camino. El diámetro del núcleo es más pequeño (menos de 10 µm).<br> <br> Medios de transmisión no guiados<br> Véanse también: Comunicación inalámbrica y Red inalámbrica.<br> En este tipo de medios, la transmisión y la recepción de información se lleva a cabo de antenas. A la hora de transmitir, la antena irradia energía electromagnética en el medio. Por el contrario, en la recepción la antena capta las ondas electromagnéticas del medio que la rodea.<br> <br> Para las transmisiones no guiadas, la configuración puede ser:<br> <br> direccional, en la que la antena transmisora emite la energía electromagnética concentrándola en un haz, por lo que las antenas emisora y receptora deben estar alineadas; y<br> omnidireccional, en la que la radiación se hace de manera dispersa, emitiendo en todas direcciones, pudiendo la señal ser recibida por varias antenas.<br> Generalmente, cuanto mayor es la frecuencia de la señal transmitida es más factible confinar la energía en un haz direccional.<br> <br> La transmisión de datos a través de medios no guiados añade problemas adicionales, provocados por la reflexión que sufre la señal en los distintos obstáculos existentes en el medio. Resultando más importante el espectro de frecuencias de la señal transmitida que el propio medio de transmisión en sí mismo.<br> <br> Según el rango de frecuencias de trabajo, las transmisiones no guiadas se pueden clasificar en tres tipos:<br> <br> Radiofrecuencia u ondas de radio;<br> microondas<br> terrestres<br> satelitales;<br> luz<br> infrarroja y<br> láser.<br> <br> Radiofrecuencias<br> Artículo principal: RF<br> En radiocomunicaciones, aunque se emplea la palabra “radio”, las transmisiones de televisión, radio (radiofonía o radiodifusión), radar y telefonía móvil están incluidas en esta clase de emisiones de radiofrecuencia. Otros usos son audio, video, radionavegación, servicios de emergencia y transmisión de datos por radio digital; tanto en el ámbito civil como militar. También son usadas por los radioaficionados.<br> <br> Microondas<br> Además de su aplicación en hornos microondas, las microondas permiten transmisiones tanto con antenas terrestres como con satélites. Dada sus frecuencias, del orden de 1 a 10 Ghz, las microondas son muy direccionales y solo se pueden emplear en situaciones en que existe una línea visual entre emisor y receptor. Los enlaces de microondas permiten grandes velocidades de transmisión, del orden de 10 Mbps.<br> <br> Infrarrojos<br> Artículos principales: Radiación infrarroja e Infrared Data Association.<br> Modo de transmisión según su sentido (señales)<br> Artículo principal: Dúplex (telecomunicaciones)<br> Símplex<br> Este modo de transmisión permite que la información discurra en un solo sentido y de forma permanente.1​ Con esta fórmula es difícil la corrección de errores causados por deficiencias de línea (por ejemplo, la señal de televisión).<br> <br> Semi-dúplex<br> En este modo la transmisión fluye en los dos sentidos, pero no simultáneamente, solo una de las dos estaciones del enlace punto a punto puede transmitir.2​ Este método también se denomina en dos sentidos alternos o símplex alternativo3​ (p. ej., el walkie-talkie).<br> <br> Dúplex (completo)<br> Es el método de comunicación más recomendable puesto que en todo momento la comunicación puede ser en dos sentidos posibles, es decir, que las dos estaciones simultáneamente pueden enviar y recibir datos y así pueden corregir los errores de manera instantánea y permanente (p. ej., el teléfono).<br>"
            },
            {
                "semana": "9",
                "title": "Introduccion De Cableado Estructurado",
                "data": "Elementos principales de un sistema de cableado estructurado<br> Cableado horizontal<br> Véase también: TIA/EIA-568-B<br> La norma del EIA/TIA 568A define el cableado horizontal de la siguiente forma: el sistema de cableado horizontal es la porción del sistema de cableado de telecomunicaciones que se extiende del área de trabajo al cuarto de telecomunicaciones o viceversa.<br> <br> El cableado horizontal se compone de dos elementos básicos: rutas y espacios verticales (también llamado \"sistemas de pasada de datos horizontal\"). Las rutas y espacios horizontales son utilizados para distribuir y soportar cable horizontal y conectar hardware entre la salida del área de trabajo y el cuarto de telecomunicaciones. Estas rutas y espacios son los \"contenedores\" del cableado horizontal.<br> <br> Si existiera cielo raso suspendido se recomienda la utilización de canaletas para transportar los cables horizontales.<br> Una tubería de ¾ pulgadas por cada dos cables UTP.<br> Una tubería de 1 pulgada por cada cable de dos fibras ópticas.<br> Los radios mínimos de curvatura deben ser bien implementados.<br> El cableado horizontal incluye:<br> <br> Las salidas (cajas/placas/conectores) de telecomunicaciones en el área de trabajo (en inglés: work area outlets, WAO).<br> Cables y conectores de transición instalados entre las salidas del área de trabajo y el cuarto de telecomunicaciones.<br> Paneles (patch panels) y cables de empalme utilizados para configurar las conexiones de cableado horizontal en el cuarto de telecomunicaciones.<br> Se deben hacer ciertas consideraciones a la hora de seleccionar el cableado horizontal: contiene la mayor cantidad de cables individuales en el edificio.<br> <br> Consideraciones de diseño<br> Los costes en materiales, mano de obra e interrupción de labores al hacer cambios en el cableado horizontal pueden ser muy altos. Para evitar estos costes, el cableado horizontal debe ser capaz de manejar una amplia gama de aplicaciones de usuario. La distribución horizontal debe ser diseñada para facilitar el mantenimiento y la relocalización de áreas de trabajo. El diseñador también debe considerar incorporar otros sistemas de información del edificio (por ej. televisión por cable, control ambiental, seguridad, audio, alarmas y sonido) al seleccionar y diseñar el cableado horizontal.<br> <br> Topología<br> La norma EIA/TIA 568A hace las siguientes recomendaciones en cuanto a la topología del cableado horizontal:<br> <br> El cableado horizontal debe seguir una topología estrella.<br> Cada toma/conector de telecomunicaciones del área de trabajo debe conectarse a una interconexión en el cuarto de telecomunicaciones.<br> La distancia horizontal máxima no debe exceder los 90 m. La distancia se mide desde la terminación mecánica del medio en la interconexión horizontal en el cuarto de telecomunicaciones hasta la toma/conector de telecomunicaciones en el área de trabajo. Además se recomiendan las siguientes distancias: se separan 10 m para los cables del área de trabajo y los cables del cuarto de telecomunicaciones (cordones de parcheo, jumpers y cables de equipo).<br> <br> Medios reconocidos<br> Se reconocen cinco tipos de cable para el sistema de cableado horizontal:<br> <br> Cables de par trenzado sin blindar (UTP) de 100 ohmios y cuatro pares.<br> Cables de par trenzado apantallado (FTP) de 120 ohmios y cuatro pares.<br> Cables de par trenzado blindado (STP) de 150 ohmios y cuatro pares.<br> Cables de fibra óptica multimodo de 62.5/125 μm y 50/125 μm.<br> Cables de fibra óptica monomodo de 9/125 μm.<br> Cableado vertical o backbone<br> El sistema de cableado vertical proporciona interconexiones entre cuartos de entrada y servicios del edificio, cuartos de equipos y cuartos de telecomunicaciones. El cableado del backbone incluye la conexión vertical (Las canalizaciones Backbone pueden ser verticales u horizontales) entre pisos en edificios de varios pisos. El cableado del backbone incluye medios de transmisión (cables), puntos principales e intermedios de conexión cruzada y terminaciones mecánicas. El cableado vertical realiza la interconexión entre los diferentes gabinetes de telecomunicaciones y entre estos y la sala de equipamiento. En este componente del sistema de cableado ya no resulta económico mantener la estructura general utilizada en el cableado horizontal, sino que es conveniente realizar instalaciones independientes para la telefonía y datos. Esto se ve reforzado por el hecho de que, si fuera necesario sustituir el backbone, ello se realiza con un coste relativamente bajo, y causando muy pocas molestias a los ocupantes del edificio. El backbone telefónico se realiza habitualmente con cable telefónico multipar. Para definir el backbone de datos es necesario tener en cuenta cuál será la disposición física del equipamiento. Normalmente, el tendido físico del backbone se realiza en forma de estrella, es decir, se interconectan los gabinetes con uno que se define como centro de la estrella, en donde se ubica el equipamiento electrónico más complejo.<br> <br> El backbone de datos se puede implementar con cables UTP y/o con fibra óptica. En el caso de decidir utilizar UTP, el mismo será de categoría 5e, 6 o 6A y se dispondrá un número de cables desde cada gabinete al gabinete seleccionado como centro de estrella.<br> <br> Actualmente, la diferencia de coste provocada por la utilización de fibra óptica se ve compensada por la mayor flexibilidad y posibilidad de crecimiento que brinda esta tecnología. Se construye el backbone llevando un cable de fibra desde cada gabinete al gabinete centro de la estrella. Si bien para una configuración mínima Ethernet basta con utilizar cable de dos fibras, resulta conveniente utilizar cable con mayor cantidad de fibras (6 a 12) ya que la diferencia de coste no es importante y se posibilita por una parte disponer de conductores de reserva para el caso de falla de algunos, y por otra parte, la utilización en el futuro de otras topologías que requieren más conductores, como FDDI o sistemas resistentes a fallas. La norma EIA/TIA 568 prevé la ubicación de la transmisión de cableado vertical a horizontal, y la ubicación de los dispositivos necesarios para lograrla, en habitaciones independientes con puerta destinada a tal fin, ubicadas por lo menos una por piso, denominadas armarios de telecomunicaciones. Se utilizan habitualmente gabinetes estándar de 19 pulgadas de ancho, con puertas, de aproximadamente 50 cm de profundidad y de una altura entre 1,5 y 2 metros. En dichos gabinetes se dispone generalmente de las siguientes secciones:<br> <br> Acometida de los puestos de trabajo: dos cables UTP llegan desde cada puesto de trabajo.<br> Acometida del backbone telefónico: cable multipar que puede terminar en regletas de conexión o en patch panels.<br> Acometida del backbone de datos: cables de fibras ópticas que se llevan a una bandeja de conexión adecuada.<br> Cuarto de entrada de servicios de cableado<br> En cables, accesorios de conexión, dispositivos de protección, y demás equipos es necesario para conectar el edificio a servicios externos. Puede contener el punto de demarcación. Ofrecen protección eléctrica establecida por códigos eléctricos aplicables. Deben ser diseñadas de acuerdo a la norma EIA/TIA-569-A. Los requerimientos de instalación son:<br> Precauciones en el manejo del cable UTP<br> Evitar tensiones en el cable<br> Los cables no deben en rutarse en grupos muy apretados<br> Utilizar rutas de cable y accesorios apropiados 100 ohmios UTP y STP<br> **No giros con un ángulo menor de 90.<br> Sistema de puesta a tierra<br> El sistema de puesta a tierra y puenteo establecido en estándar ANSI/TIA/EIA-607 es un componente importante de cualquier sistema de cableado estructurado moderno. El gabinete deberá disponer de una toma de tierra, conectada a la tierra general de la instalación eléctrica, para efectuar las conexiones de todo equipamiento. El conducto de tierra no siempre se halla indicado en planos y puede ser único para ramales o circuitos que pasen por las mismas cajas de pase, conductos o bandejas. Los cables de tierra de seguridad serán puesto.<br> <br> Atenuación<br> Las señales de transmisión a través de largas distancias están sujetas a distorsión que es una pérdida de fuerza o amplitud de la señal. La atenuación es la razón principal de que el largo de las redes tenga varias restricciones. Si la señal se hace muy débil, el equipo receptor no interceptará bien o no reconocerá esta información.<br> <br> Esto causa errores, bajo desempeño al tener que retransmitir la señal. Se usan repetidores o amplificadores para extender las distancias de la red más allá de las limitaciones del cable. La atenuación se mide con aparatos que inyectan una señal de prueba en un extremo del cable y la miden en el otro extremo. Atenuación es la pérdida de señal debido a la distancia de un punto a otro.<br> <br> Capacitancia del cable<br> Artículo principal: Capacidad eléctrica<br> La capacitancia o capacidad puede distorsionar la señal en el cable: cuanto más largo sea el cable, y más delgado el espesor del aislante, mayor es la capacitancia, lo que resulta en distorsión.<br> <br> La capacidad es la unidad de medida de la energía almacenada en un capacitor y el cable al tener dos o más electrodos separados por un material dieléctrico se comporta básicamente como un capacitor.<br> <br> Los probadores de cable pueden medir la capacidad de este par para determinar si el cable ha sido roscado o estirado. La capacidad del cable de par trenzado en las redes está entre 17 y 20 pF.<br> <br> Velocidad según la categoría de la red<br> Artículo principal: Cable de par trenzado<br> categoría 1: se utiliza para comunicaciones telefónicas y no es adecuado para la transmisión de datos ya que sus velocidades no alcanzan los 512 kbit/s.<br> categoría 2: puede transmitir datos a velocidades de hasta 4 Mbit/s.<br> categoría 3: se utiliza en redes 10BaseT y puede transmitir datos a velocidades de hasta 10 Mbit/s.<br> categoría 4: se utiliza en redes Token Ring y puede transmitir datos a velocidades de hasta 16 Mbit/s.<br> categoría 5: puede transmitir datos a velocidades de hasta 100 Mbit/s.<br> categoría 5e: puede transmitir datos a velocidades de hasta 1000 Mbit/s.<br> categoría 6: Redes de alta velocidad hasta 1 Gbit/s.<br> categoría 6A: Redes de alta velocidad hasta 10 Gbit/s.<br> categoría 7: Redes de alta velocidad de hasta 10 Gbit/s y frecuencias hasta 600 MHz<br> categoría 7A: Redes de alta velocidad de hasta 10 Gbit/s y frecuencias hasta 1000 MHz<br> categoría 8: Redes de alta velocidad de hasta 40 Gbit/s y frecuencias hasta 2000 MHz<br> Impedancia y distorsión por retardado<br> Las líneas de transmisión tendrán en alguna porción ruido de fondo, generado por fuentes externas, el transmisor o las líneas adyacentes. Este ruido se combina con la señal transmitida. La distorsión resultante puede ser menor, pero la atenuación puede provocar que la señal digital descienda al nivel de la señal de ruido. El nivel de la señal digital es mayor que el nivel de la señal de ruido, pero se acerca al nivel de la señal de ruido a medida que se acerca al receptor. Una señal formada por varias frecuencias es propensa a la distorsión por retardo causada por la impedancia, la cual es la resistencia al cambio de las diferentes frecuencias. Esta puede provocar que los diferentes componentes de frecuencia que contienen las señales lleguen fuera de tiempo al receptor. Si la frecuencia se incrementa, el efecto empeora y el receptor estará imposibilitado de interpretar las señales correctamente. Este problema puede resolverse disminuyendo el largo del cable. Nótese que la medición de la impedancia nos sirve para detectar roturas del cable o falta de conexiones. El cable debe tener una impedancia de 100 ohmios en la frecuencia usada para transmitir datos. Es importante mantener un nivel de señal sobre el nivel de ruido. La mayor fuente de ruido en un cable par trenzado con varios alambres es la interferencia. La interferencia es una ruptura de los cables adyacentes y no es un problema típico de los cables. El ruido ambiental en los circuitos digitales es provocado por las lámparas fluorescentes, motores, hornos de microondas y equipos de oficina como computadoras, fax, teléfonos y copiadoras. Para medir la interferencia se inyecta una señal de valor conocido en un extremo y se mide la interferencia en los cables vecinos.<br> <br> TIA-526-7 “Measurement of Optical Power Loss of Installed Single-Mode Fiber Cable Plant” – OFSTP-7 - (febrero de 2002).<br> TIA-526-14-A “Optical Power Loss Measurements of Installed Multimode Fiber Cable Plant” – OFSTP-14 - (agosto de 1998).<br> ANSI/TIA/EIA-568-B.1 de Alambrado de Telecomunicaciones para Edificios Comerciales, Parte 1: Requerimientos Generales, mayo de 2001.<br> Adenda ANSI/TIA/EIA-568-B.1-1-2001, Adenda 1, Radio de Curvatura Mínimo para Cables de 4 Pares UTP y STP, julio de 2001.<br> TIA/EIA-568-B.1-2 “Commercial Building Telecommunications Cabling Standard Part 1: General Requirements Addendum 2 – Grounding and Bonding Requirements for Screened Balanced Twisted-Pair Horizontal Cabling” - (febrero de 2003).<br> TIA/EIA-568-B.1-3 “Commercial Building Telecommunications Cabling Standard Part 1: General Requirements Addendum 3 – Supportable Distances and Channel Attenuation for Optical Fiber Applications by Fiber Type” - (febrero de 2003)<br> TIA/EIA-568-B.1-4 “Commercial Building Telecommunications Cabling Standard Part 1: General Requirements Addendum 4 – Recognition of Category 6 and 850 nm Laser Optimized 50/125 μm Multimode Optical Fiber Cabling” - (febrero de 2003)<br> TIA/EIA-568-B.1-5 “Commercial Building Telecommunications Cabling Standard Part 1: General Requirements Addendum 5 – Telecommunications Cabling for Telecommunications Enclosures” – (marzo de 2004)<br> TIA/EIA-568-B.1-7 “Commercial Building Telecommunications Cabling Standard Part 1: General Requirements Addendum 7 - Guidelines for Maintaining Polarity Using Array Connectors” – (enero de 2006)<br> TIA/EIA-568-B.2 “Commercial Building Telecommunications Cabling Standard Part 2: Balanced Twisted-Pair Cabling Components” - (diciembre de 2003)<br> TIA/EIA-568-B.2-1 “Commercial Building Telecommunications Cabling Standard Part 2: Balanced Twisted-Pair Cabling Components – Addendum 1 – Transmission Performance Specifications for 4-Pair 100 ohm Category 6 Cabling” - (junio de 2002)<br> TIA/EIA-568-B.2-2 “Commercial Building Telecommunications Cabling Standard Part 2: Balanced Twisted-Pair Cabling Components – Addendum 2 – Revision of Sub-clauses” - (diciembre de 2001)<br> TIA/EIA-568-B.2-3 “”Commercial Building Telecommunications Cabling Standard Part 2: Balanced Twisted-Pair Cabling Components – Addendum 3 – Additional Considerations for Insertion Loss & Return Loss Pass/Fail Determination” - (marzo de 2002)<br> TIA/EIA-568-B.2-4 “Commercial Building Telecommunications Cabling Standard Part 2: Balanced Twisted-Pair Cabling Components – Addendum 4 – Solderless Connection Reliability Requirements for Copper Connecting Hardware” - (junio de 2002)<br> TIA/EIA-568-B.2-5 “Commercial Building Telecommunications Cabling Standard Part 2: Balanced Twisted-Pair Cabling Components – Addendum 5 – Corrections to TIA/EIA-568-B.2” – (enero de 2003)<br> TIA/EIA-568-B.2-6 “Commercial Building Telecommunications Cabling Standard Part 2: Balanced Twisted-Pair Cabling Components – Addendum 6 – Category 6 Related Component Test Procedures” – (diciembre de 2003)<br> TIA/EIA-568-B.2-11 “Commercial Building Telecommunications Cabling Standard Part 2: Balanced Twisted-Pair Cabling Components – Addendum 11 - Specification of 4-Pair UTP and SCTP Cabling” – (diciembre de 2005)<br> TIA/EIA-568-3 “Optical Fiber Cabling Components Standard” - (abril de 2002)<br> TIA/EIA-568-3.1 “Optical Fiber Cabling Components Standard – Addendum 1 – Additional Transmission Performance Specifications for 50/125 μm Optical Fiber Cables” – (abril de 2002)<br> TIA-569-B “Commercial Building Standard for Telecommunications Pathways and Spaces” - (octubre de 2004)<br> TIA-598-C “Optical Fiber Cable Color Coding” - (enero de 2005)<br> TIA/EIA-606-A “Administration Standard for Commercial Telecommunications Infrastructure” - (mayo de 2002)<br> J-STD-607-A “Commercial Building Grounding (Earthing) and Bonding Requirements for Telecommunications” - (octubre de 2002)<br>"
            },
            {
                "semana": "10",
                "title": "Dispositivos De Red",
                "data": "Aprende cómo las redes LAN, conectadas por dispositivos de red intermedios, hacen que funcione como una gran red.<br> <br> Un dispositivo de interconexión de redes es un término ampliamente utilizado para cualquier hardware que conecte diferentes recursos de red. Los dispositivos clave que comprenden una red son conmutadores, enrutadores, brigde (puentes), repetidores y puertas de enlace.<br> <br> Todos los dispositivos tienen características de alcance por separado, según los requisitos y escenarios de la red. Los siguientes son escenarios de interconexión:<br> <br> Una sola LAN<br> Dos LAN conectadas entre sí (LAN-LAN)<br> Una LAN conectada a una WAN (LAN-WAN)<br> Dos LAN conectadas a través de una WAN (LAN-WAN-LAN)<br> Para entender los diversos dispositivos de interconexión de redes, creamos el siguiente glosario.<br> <br> Repetidores<br> Se utilizan para extender la longitud de la red. Fueron creados para regenerar y amplificar señales débiles, extendiendo así la longitud de la red. La función básica de un repetidor es remodelar y reamplificar la señal de datos a su nivel original.<br> <br> Las características importantes de estos equipos son las siguientes:<br> <br> Conectar diferentes segmentos de red de una LAN<br> Reenviar cada paquete que recibe<br> Un repetidor es un regenerador, no un amplificador<br> Los repetidores operan en la capa física del modelo OSI<br> Hubs<br> Un Hub es básicamente un repetidor multipuerto, actúa como concentrador y conecta múltiples cables provenientes de diferentes conexiones. Los concentradores no pueden filtrar datos, por lo que los paquetes de datos se envían a todos los dispositivos conectados, el dominio de colisión de todos los hosts conectados a través de Hub sigue siendo uno.<br> <br> Los Hubs no tienen inteligencia para encontrar la mejor ruta para los paquetes, las consecuencias: ineficiencia y desperdicio.<br> <br> Bridge<br> Un bridge o un puente opera en la capa de enlace de datos. Es un repetidor con funcionalidad adicional de filtrado al leer las direcciones MAC de origen y destino. También se usa para interconectar dos LAN que funcionan en el mismo protocolo. Tiene un puerto de entrada y salida único, lo que lo convierte en un dispositivo de 2 puertos.<br> <br> Switch o conmutador<br> El switch es un puente de múltiples puertos, es un dispositivo de capa de enlace de datos. El conmutador es muy eficiente, realiza una verificación de errores antes de reenviar paquetes. En otras palabras, el conmutador divide el dominio de colisión de los hosts, pero el dominio de difusión sigue siendo el mismo.<br> <br> Router<br> Los enrutadores enlazan dos o más redes diferentes, estas pueden constar de varios tipos de segmentos de red LAN. Un enrutador recibe paquetes y selecciona la ruta óptima para reenviar el paquete a través de la red.<br> <br> Los enrutadores crean una tabla de todas las direcciones de los dispositivos, llamada tabla de enrutamiento. Con ella, el enrutador envía una transmisión desde la fuente ​​hacia el destino a través de la mejor ruta. Los enrutadores funcionan en el nivel de red del modelo OSI.<br> <br> Gateway<br> Las puertas de enlace son dispositivos de conexión multipropósito para crear uniones entre redes diferentes. Son capaces de convertir el formato de los paquetes de un entorno, a otro formato. Funcionan como agentes de mensajería que toman datos de un sistema, los interpretan y transfieren a otro sistema.<br>"
            },
            {
                "semana": "11",
                "title": "Subnetting",
                "data": "¿Qué es el subnetting? Definido de la forma más simple, el término subnetting hace referencia a la subdivisión de una red en varias subredes. El subneteo permite a los administradores de red, por ejemplo, dividir una red empresarial en varias subredes sin hacerlo público en Internet. Esto se traduce en que el router que establece la conexión entre la red e Internet se especifica como dirección única, aunque puede que haya varios hosts ocultos. Así, el número de hosts que están a disposición del administrador aumenta considerablemente. Con la aparición de IPv6, que abarca 128 bits y reemplazará a la versión IPv4 en los próximos años, las direcciones IP ausentes ya no tendrán un papel principal para la creación de subredes. Nota debido a que las direcciones IPv6 con 128 bits en forma decimal son muy largas se muestran en formato hexadecimal. Asimismo, los bloques de bits que solo contienen ceros aparecen vacíos en la notación: 2001:620::211:24FF:FE80:C12C. Si quieres obtener más información al respecto, visita nuestra guía sobre la versión 6 del protocolo de Internet. Los motivos para el subneteo de redes son múltiples. Las subredes funcionan de manera independiente las unas de las otras y la recogida de los datos se lleva a cabo con mayor celeridad. ¿Cuál es el motivo para ello? El subnetting hace que la red adquiera una mayor claridad. El denominado broadcast, en el que los participantes envían datos a toda la red, se lleva a cabo de manera descontrolada a través de subredes pero, por medio de subnets, el router envía los paquetes de datos al destinatario específico. Si los emisores y los receptores se encuentran en la misma subred, los datos se pueden enviar directamente y no tienen que desviarse. Cuando se introdujo el protocolo de Internet, la Internet Engineering Task Force (IETF) estableció las cinco clases de direcciones IP A, B, C, D y E. Cada una de estas clases puede identificarse por medio del rango de direcciones en el que se encuentran. Clase A Clase B Clase C Clase D Clase E 0.0.0.0 - 127.255.255.255 128.0.0.0 - 191.255.255.255 192.0.0.0 - 223.255.255.255 224.0.0.0 - 239.255.255.255 240.0.0.0 - 255.255.255.255 La clase determina el número de direcciones de red que están disponibles y la cantidad de hosts que albergan las respectivas redes. En la clase A, el primer bloque numérico (también denominado octeto porque un bloque está compuesto por 8 bits) está reservado para la dirección de red y los tres últimos están disponibles para los ID de los hosts, lo que significa que hay pocas redes pero muchos hosts. En la clase B, los primeros dos bloques son responsables de los Net ID, lo que da como resultado más redes pero menos hosts. La clase C solo alberga el último octeto para las direcciones de hosts restantes. Por su parte, los rangos de direcciones de las clases D y E están reservados y no se pueden adjudicar. Nota desde 1993 las clases ya no son relevantes para el tamaño de las redes, pero debido a que el subneteo fue introducido en el año 1985 y estaba pensado como solución al problema del limitado tamaño de red, es importante entender el sistema. En la actualidad Internet se basa en el principio del Classless Inter-Domain Routing (CIDR), en español “enrutamiento entre dominios sin clases” y, en este caso, no se tiene en cuenta el tamaño de la red en la dirección IP. ¿Cómo funciona el subnetting? En el subnetting o subneteo se toman bits del ID del host “prestados” para crear una subred. Con solo un bit se tiene la posibilidad de generar dos subredes, puesto que solo se tiene en cuenta el 0 o el 1. Para un número mayor de subredes se tienen que liberar más bits, de modo que hay menos espacio para direcciones de hosts. Cabe remarcar en este caso que tanto las direcciones IP de una subred como aquellas que no forman parte de ninguna tienen la misma apariencia y los ordenadores tampoco detectan ninguna diferencia, de ahí que se creen las llamadas máscaras de subred. Si se envían paquetes de datos de Internet a la propia red, el router es capaz de decidir mediante esta máscara en qué subred distribuye los datos. Como ocurre con las direcciones de IPv4, las máscaras de red contienen 32 bits (o 4 bytes) y se depositan en la dirección como una máscara o una plantilla. Una típica máscara de subred tendría la siguiente apariencia: 255.255.255.128 Consejo tanto la dirección IP como la máscara de subred pueden encontrarse en Windows a través del símbolo del sistema y del comando ipconfig. Esto también puede representarse de forma binaria: 11111111.11111111.11111111.10000000 A continuación creamos la comparación AND lógica: Dirección IP 11000000 10101000 01011000 00000011 Máscara de subred 11111111 11111111 11111111 10000000 Comparación AND 11000000 10101000 01011000 00000000 Para la comparación se supone que la combinación de dos unos en la misma posición vuelve a dar un uno como resultado. El resto de comparaciones (1/0, 0/1 y 0/0) dan 0 como resultado. (Esta comparación no es un proceso en el que tú seas el único participante, sino que el router también realiza los cálculos). La comparación AND arroja la dirección de red. Para la dirección del host se tienen en cuenta todas las posiciones que aparecen en el lado derecho de los ceros, como en nuestro ejemplo: Dirección IP:         192.168.88.3 Net ID:                 192.168.88.0 Host ID:                0.0.0.3 Nota en una subred se utilizan tanto la primera como la última dirección IP de forma limitada. La primera dirección IP (en la parte del host solo tiene ceros) se establece como dirección de red. La última dirección (255 en la parte del host) se utiliza como dirección de broadcast. Por consiguiente, se puede asumir que, con respecto al número de direcciones disponibles, siempre hay dos hosts menos. ¿Cómo se calcula una máscara de red? Ya hemos explicado cuáles son las conclusiones que se pueden extraer de las direcciones IP y de las máscaras de red. Sin embargo, de manera habitual, los administradores de red se enfrentan a otro problema: dados la dirección de red y el número de hosts que debe alojar la subred, el administrador debe calcular una máscara de subred que permita suficientes hosts. Para ello utiliza la fórmula x = 2^n - 2. Puesto que se trata de un sistema binario, el cálculo se hará con potencias de dos. n hace referencia al número de bits que son iguales a cero en la máscara de red. A continuación, se resta el valor 2 para hacer desaparecer las direcciones de broadcast y de red y X arroja como resultado los hosts posibles. Si, por ejemplo, un administrador de red tiene que alojar 150 ordenadores en su red, en primer lugar buscará la potencia más elevada de 2, donde 27 no se tiene en cuenta, ya que 128 es un número muy bajo. Por ello, escogerá 28-2, es decir, 254 hosts. Los últimos 8 bits de la máscara de red son, por lo tanto, 0. Binario 11111111 11111111 11111111 00000000 Decimal 255 255 255 0 Con la máscara de subred 255.255.255.0 se pueden liberar suficientes hosts. También debe tenerse en cuenta que solo deben crearse subredes tomando bits prestados de la parte del host de izquierda a derecha. De ello se deduce la estructura ordenada de la máscara de subred y el hecho de que solo puedan utilizarse nueve valores diferentes en un octeto: Binario Decimal 00000000 0 10000000 128 11000000 192 11100000 224 11110000 240 11111000 248 11111100 252 11111110 254 11111111 255 Nota es común que las máscaras de subred se presenten a través de un sufijo: en lugar de mencionar la dirección IP y la máscara de subred de manera individual, también se puede indicar la cantidad de unos como complemento para la dirección IP. En nuestro ejemplo inicial esto aparece reflejado como: 192.168.88.3 / 25 ¿Por qué es tan importante el subnetting? Las secuencias numéricas, las conversiones binarias y las comparaciones lógicas tienen un efecto disuasorio. Sobre todo en el contexto de la transición a IPv6 muchos se preguntan si realmente merece la pena. La respuesta es claramente afirmativa. Esto es lo que hace que el subneteo también sea relevante para el futuro: Ampliación del rango de direcciones dentro de una red: el subnetting permite que el administrador de redes pueda decidir el tamaño que tendrán sus redes. Conexión rápida entre los hosts y las subredes: los paquetes de datos llegan directamente del emisor al receptor y, en principio, no se transmiten por toda la red a través del router. Mejor organización lógica de losparticipantes en la red: para obtener una visión más completa de los hosts, es conveniente hacer una segmentación de los mismos por departamentos o en función de criterios locales (edificios y plantas diferentes). Mayor grado de seguridad: si un participante de la red es víctima de un ataque externo, la amenaza se extiende rápidamente a toda la red. El subneteo permite a los administradores de redes aislar las subredes mucho más fácilmente. Hecho el supernetting es el proceso contrario al subnetting y consiste en la combinación de varias redes o subredes, tras lo que disminuyen las partes de red de las direcciones para facilitar más hosts en una misma red. En las redes medianas y grandes el proceso de creación de subredes resulta algo más que razonable. El esfuerzo inicial necesario se ve compensado con creces porque la subdivisión de la red empresarial permite mantener la perspectiva y detectar problemas con mayor rapidez. Al igual que en el día a día, mantener el orden siempre tiene su recompensa."
            },
            {
                "semana": "13",
                "title": "Transporte De Datos TCP y UPD",
                "data": "TCP y UDP son dos protocolos fundamentales para las comunicaciones a través de Internet, ya que estos dos protocolos se sitúan en la capa de transporte del modelo TCP/IP, y es la primera capa donde origen y destino se comunican directamente, ya que las capas inferiores (capa de red y capa de acceso al medio) no realizan esta función. Hoy en RedesZone os vamos a explicar las principales características del protocolo TCP y del protocolo UDP, cuándo se utiliza cada uno, diferencias y usos principales.<br> <br> Protocolo TCP: ¿qué es y cómo funciona?<br> El protocolo TCP (Protocolo de Control de Transmisión) es uno de los protocolos fundamentales en Internet, nos permite que las aplicaciones puedan comunicarse con garantías independientemente de las capas inferiores del modelo TCP/IP. Esto significa que los routers (capa de red en el modelo TCP/IP) solamente tienen que enviar los segmentos (unidad de medida en TCP), sin preocuparse si van a llegar esos datos correctamente o no. TCP da soporte a múltiples protocolos de la capa de aplicación, como, por ejemplo, HTTP (web), HTTPS (web segura), POP3 (correo entrante) y SMTP (correo saliente) así como sus versiones seguras utilizando TLS. También se utiliza TCP en protocolos tan importantes como FTP, FTPES y SFTP para transferir archivos desde un origen a un destino, e incluso el protocolo SSH para administrar equipos de forma local y remota de manera segura utiliza el protocolo TCP.<br> <br> Principales características<br> Debido a que TCP sirve a una gran cantidad de protocolos de la capa de aplicación, es fundamental que los datos (segmentos) lleguen correctamente al destinatario, sin errores, y, en orden. Si en la transmisión de los segmentos, se corrompiesen o perdiesen, automáticamente el protocolo TCP inicia la retransmisión, sin intervención de la capa de aplicación. De esta manera, se garantiza que los datos llegan al destinatario sin errores, ya que este protocolo se encarga de solucionar cualquier tipo de problema.<br> <br> El MSS (Maximum Segment Size) es el tamaño máximo en bytes que TCP puede recibir en un solo segmento, es similar al MTU, pero el MSS es a nivel de capa de transporte. Con el fin de obtener el mejor rendimiento, el MSS debe ser lo suficientemente pequeño para evitar fragmentación IP. El MSS se anuncia normalmente en cada lado del canal de comunicación, a través de la propia cabecera de TCP. Normalmente el tamaño del MSS es el MTU (1500 bytes normalmente) menos la cabecera de TCP (que tiene longitud variable de al menos 20 bytes) menos la cabecera IP (que tiene longitud variable de al menos 20 bytes). MSS = MTU (1.500 bytes) – 20 bytes cabecera TCP – 20 bytes cabecera IP<br> <br> TCP tiene un mecanismo complejo de control de errores, se utiliza una técnica de ventana deslizante para que todos los segmentos lleguen correctamente. Esta característica utiliza diferentes métodos para detectar posibles errores que se produzcan:<br> <br> Checksum<br> Numeración de todos los segmentos para llevar correctamente el control<br> Confirmaciones ACK selectivas, aunque también permite «acumular» segmentos para que con un úncio ACK se confirmen varios.<br> Temporizadores: si pasa mucho tiempo, automáticamente TCP retransmite el segmento que se ha «perdido».<br> Se descartan los segmentos duplicados: en caso de que llegue un segmento duplicado (porque uno ha tardado más de lo normal y se ha vuelto a enviar) lo elimina.<br> Por supuesto, si TCP detecta un error, iniciará la retransmisión automáticamente sin que la capa de aplicación tenga que hacer absolutamente nada.<br> <br> Otra característica muy importante la información que viaja desde un origen hasta un destino, es que los datos lleguen en orden, es decir, en el mismo orden que fueron emitidos, ya que el protocolo IP es un protocolo best-effort, hace todo lo que puede para que los paquetes lleguen en orden y correctos, pero no es confiable ya que no garantiza nada. TCP dispone de una ventana deslizante en el emisor y en el receptor, de tal forma que, si recibimos un segmento que no está en orden, automáticamente «esperará» hasta que llegue el segmento que falta, o sino, pedirá una retransmisión únicamente del segmento que falte. Con cada segmento recibido por el receptor, se enviará un ACK indicando al emisor que todo está llegando correctamente, no obstante, en la vida real las implementaciones de TCP permiten que se envíe un ACK para confirmar la recepción de varios segmentos simultáneamente, con el objetivo de no saturar la red de tantas confirmaciones.<br> <br> El protocolo TCP permite realizar control de flujo, es decir, es capaz de mitigar la posible saturación de la red o del host remoto. En el caso de que un equipo esté transmitiendo a una velocidad de 500Mbps, y el equipo de destino solamente pueda recibir información a 100Mbps, el protocolo TCP se adapta dinámicamente. De esta forma, el protocolo TCP siempre intentará aprovechar al máximo el ancho de banda disponible entre origen y destino. El funcionamiento de la esta ventana deslizante es complejo, pero funciona básicamente en que el receptor tiene una ventana TCP disponible con una cantidad de bytes que puede almacenar en un buffer, el emisor podrá enviar datos hasta llenar esta cantidad. Para que el emisor envíe más datos, es necesario que el receptor le envíe un ACK indicando que todo está correcto y que procede a «subirlo» a capa de aplicación.<br> <br> TCP también dispone de control de congestión, esto nos permite que no se pierdan paquetes en Internet porque haya congestión en los routers. Si el router no es capaz de procesar o reenviar paquetes al ritmo que los recibe, el propio router los descartará y se perderá, ya que su buffer se llenará. No debemos confundir control de flujo (que hemos explicado anteriormente) con el control de congestión. La ventana de congestión (es complementaria a la ventana de recepción) es lo que se utiliza para gestionar el control de congestión en TCP. En una situación de no congestión, la ventaja de congestión es igual que la ventana de recepción, si se produce congestión, el tamaño de la ventaja de congestión se va reduciendo, y si desaparece, va aumentando. El número máximo de bytes que puede enviar el emisor es el mínimo de ambos tamaños de ventana (si la ventana de congestión son 1500 bytes, y la ventana de recepción son 2000 bytes, entonces se envían 1500 bytes, el menor).<br> <br> Con el fin de evitar la congestión, y que podamos exprimir al máximo el ancho de banda disponible entre origen y destino, hay un total de tres fases. La fase de arranque lento (slow start) se encarga de hacer crecer exponencialmente (así que realmente no se puede considerar arranque lento) la ventana de congestión, posteriormente la fase de evitación de congestión que se encarga de que crezca la ventana de congestión linealmente, y, finalmente, la fase constante donde la ventana de recepción es la misma que la ventana de congestión.<br> <br> Actualmente TCP dispone de diferentes algoritmos para gestionar de manera eficiente la congestión, los primeros fueron TCP Tahoe y Reno, aunque también tenemos otros como TCP Vegas, pero, a lo largo de los años, con las nuevas redes de datos TCP/IP, han aparecido otros algoritmos que son más eficientes. Por ejemplo, tenemos TCP BRR que nos permite enviar información lo más rápidamente posible, ya que es mucho más eficiente que el protocolo TCP original (tendremos mayor velocidad). También tenemos TCP Cubic el cual es el control de congestión que utilizan los sistemas operativos Linux y Unix.<br> <br> <br> Por último, otra característica interesante de TCP es que nos permite multiplexar datos, de esta forma, podremos recibir información de diferentes hosts simultáneamente. También nos permite Full-Dúplex, ya que podremos enviar y recibir datos simultáneamente por el mismo canal de comunicación.<br>"
            },
            {
                "semana": "14y15",
                "title": "Protocolos De Aplicacion",
                "data": "Capa de Aplicación<br> <br> ▸ La función depende de la aplicación que se use, pero se podría<br> resumir en proporcionar servicios de red que proporcionan la interfaz<br> con el sistema operativo para que el usuario pueda interactuar<br> acorde con la máquina ya sea enviando correos y datos o<br> descargando información.<br> <br> 17<br> <br> Capas de modelo<br> TCP/IP<br> <br> Protocolos de la Capa de Aplicación<br> <br> ▸ FTP (File Transfer Protocol): Transferencia interactiva de archivos.<br> ▸ TELNET: Iniciación de la sesión de forma remota en máquinas de la<br> red.<br> ▸ HTTP (Hypertext Transfer Protocol): Transferir archivos que forman<br> las páginas web de la World Wide Web.<br> ▸ SMTP (Simple Mail Transfer Protocol): Transferencia de mensajes de<br> correo electrónico y archivos adjuntos.<br> ▸ DNS (Domain Name System): Resolución del nombre de un host a la<br> dirección IP.<br>"
            },
            {
                "semana": "16",
                "title": "Desempeño De Las Redes",
                "data": "El rendimiento de red se refiere a las medidas de calidad de servicio de un producto de telecomunicaciones desde el punto de vista del cliente.<br> <br> La siguiente lista ofrece ejemplos de medidas de desempeño de red para una red de conmutación de circuitos y un tipo de red de conmutación de paquetes, a saber, ATM:<br> <br> redes de conmutación de circuitos: En redes de conmutación de circuitos, el rendimiento de la red es sinónimo con el grado de servicio. El número de llamadas rechazadas es una medida de lo bien que la red está funcionando bajo cargas de tráfico pesado.1​ Otros tipos de medidas de desempeño pueden incluir ruido, eco y otros.<br> ATM: En una red de modo de transferencia asíncrono (ATM), el rendimiento puede ser medido por velocidad de línea, calidad de servicio (QoS), el rendimiento de datos, tiempo de conexión, la estabilidad, la tecnología, la técnica de modulación y mejoras de módem.2​<br> Hay muchas formas diferentes de medir el rendimiento de una red, ya que cada red es diferente en su naturaleza y diseño. El rendimiento también puede ser modelado en lugar de medir; un ejemplo de esto es usar diagramas de transición de estados para modelar el rendimiento de colas en una red de conmutación de circuitos. Estos diagramas permiten que el planificador de la red analice cómo la red se comportará en cada estado, asegurando que la red se diseñe de manera óptima.3Las siguientes medidas son a menudo consideradas importantes:<br> <br> Ancho de banda medido en bits/segundo es la velocidad máxima en la que la información puede ser transferida<br> El throughput es la tasa real de que la información es transferida<br> Latencia es la demora entre el envío desde el emisor y el descifrado por el receptor, esto es principalmente una función del tiempo de viaje de las señales, y el tiempo de procesamiento en los nodos que la información atraviesa.<br> Jitter es la variación en el tiempo de llegada al receptor de la información.<br> La tasa de error es el número de bits corruptos expresado como fracción del total enviado.<br> Un malentendido común es pensar que tener un mayor throughput significa una conexión ‘más rápida’. Sin embargo, throughput, latencia, el tipo de información transmitida, y la forma en que la información se aplica afectan a la velocidad percibida de una conexión.<br> <br> Ancho de banda<br> Artículo principal: Ancho de banda (informática)<br> El ancho de banda disponible en el canal y la relación señal a ruido alcanzable de determinan el máximo throughput posible. Generalmente no es posible enviar más datos de lo dictado por el Teorema de Shannon-Hartley.<br> <br> Throughput<br> Artículo principal: Throughput<br> Throughput es denominado como el número de mensajes que fueron recibidos de manera exitosa, por unidad de tiempo. Es controlado por el ancho de banda disponible, la señal a radio (decibeles) disponible y las limitaciones del hardware. Para propósitos de este artículo, Throughput, será tomado en cuenta desde el primer bit de información que llega al receptor; esto con el fin de separar el concepto, con el de latencia, ya que generalmente son usados como sinónimos.<br> <br> Time Window es la unidad en la cual Throughput es medida. La elección de una ventana de tiempo adecuada denominara generalmente los cálculos de Throughput; la latencia afecta en el cálculo de Throughput cuando es tomada en cuenta. Si esta no se incluye no afecta el Throughput .<br> <br> Latencia<br> Artículo principal: Latencia<br> La velocidad de la luz impone un tiempo mínimo de propagación de todas las señales electromagnéticas. No es posible disminuir la latencia debajo de<br> <br> <br> donde s= es la distancia, y c= la velocidad de la luz, en la mitad. Otros retrasos surgen en nodos intermedios. En una red de paquetes conmutados pueden surgir retrasos debido a la espera para poner los paquetes en una cola.<br> <br> Jitter<br> Artículo principal: Jitter<br> Jitter es la desviación no deseada de la periodicidad verdadera de una señal asumida como periódica, en electrónica y telecomunicaciones, muchas veces relacionada en referencia a una señal de reloj. Jitter puede encontrarse presente en características como la frecuencia de sucesivas pulsaciones, la amplitud de señal o fase de señales periódicas. Jitter es un factor importante y usualmente no deseado, en el diseño de casi todas las ligas de comunicación (e.g., USB, PCI-e, SATA, OC-48). En aplicaciones de recuperación de reloj es denominado como timing jitter.<br> <br> Tasa de error<br> Artículo principal: Bit Error Rate<br> En transmisiones digitales el número de errores binarios son el número de bits recibidos de una corriente de datos sobre un canal de comunicación que ha sido alterado debido a ruido, interferencia, distorsión o errores de sincronización bit.<br> <br> El rango de error binario o tasa de error binario, es el número de errores bit, divididos por el número total de bits transferidos durante el intervalo de tiempo estudiado. El rango de error binario es la medición de tiempo sin medida, que es usualmente expresada como el porcentaje.<br> <br> La probabilidad de error bit p, es el valor esperado de la tasa de error binario. Puede ser considerado como una aproximación estimada de la probabilidad de error binario. En intervalos de larga duración y alto número de errores binarios la estimación es acertada.<br> <br> Interacción de factores<br> Los factores anteriores, en conjunto con los requerimientos de usuario y la percepción del mismo, juegan un rol importante para determinar la rapidez y utilidad de una conexión de red. La relación entre throughput y latencia, y el conocimiento del usuario es mejor reconocida en el contexto de una conexión compartida y como un problema de programación, esto se toma en cuenta cuando los sistemas se encuentran fuertemente dominados por la latencia o el throughput.<br> <br> Algoritmos y protocolos<br> Para algunos sistemas los términos de latencia y throughput son lo mismo. En TCP/IP, la latencia puede afectar de manera directa el throughput. En las conexiones del Protocolo de Control de Transmisión, el retraso del ancho de banda que tiene una conexión con alta latencia, combinado con un TCP relativamente pequeño, causa que el throughput con una conexión de alta latencia caiga abruptamente con latencia. Esto puede ser solucionado de varias maneras; se puede incrementar la congestión del tamaño de la ventana del TCP en varios equipos; o una solución más drástica, un paquete de coalescencia, los cuales son comúnmente usados para ligas satelitales con alta latencia.<br> <br> La aceleración del TCP convierte a los paquetes del mismo, en una corriente que es parecida al UDP. Es por eso que el software de aceleración del TCP debe de tener sus propios mecanismos para asegurar la confianza de la liga, tomando en cuenta la latencia y el ancho de banda, los dos medios de la alta latencia de la liga deben de ser capaces de sostener el método usado.<br> <br> En la capa de Control de Acceso a medios de comunicación, se abordan temas de problemas de rendimiento y el retardo de extremo a extremo.<br> <br> Ejemplos de sistemas dominados por latencia o throughput<br> Algunos sistemas pueden estar caracterizados por estar dominados por limitaciones de throughput o de latencia, en términos utilidad y experiencia en productos terminados. En algunas situaciones, límites difíciles como la velocidad de la luz pueden presentar problemas específicos a esos sistemas y no hay manera de corregirlo. Otros sistemas permiten optimización para una mejor experiencia de usuario.<br> <br> Telefonía satelital<br> Un satélite de telecomunicaciones en una órbita geosíncrona impone un camino de al menos 71 000 km o una latencia de 473 ms entre transmisor y receptor (Network performance), lo que significa un retraso pequeño entre el envío del mensaje y su recepción. El retraso sí puede ser notado y afecta el servicio de telefonía satelital a pesar de la capacidad del throughput disponible.<br> <br> Comunicación en el espacio profundo<br> Las consideraciones de distancias muy largas se ve empeorada cuando se quiere comunicar con sondas espaciales y otros blancos de con un rango más allá de la atmósfera de la Tierra. La red del espacio profundo que fue implementado por la NASA, es un sistema capaz de lidiar con esos problemas. Se han propuesto varios métodos con el fin de arreglar la intermitencia en la conexión y el retraso entre mensajes, como una Red tolerante a demoras.<br> <br> Comunicación en el espacio aún más profundo<br> En distancias interestelares el diseño de un sistema de radio que pueda alcanzar cualquier throughput las dificultades son enormes. En estos casos, mantener la comunicación es un problema más grande que el tiempo que la comunicación tarda.<br> <br> Transmisión de información sin señal<br> Casi toda la transmisión se encuentra basada en el throughput , es por eso que casi todas las entregas físicas de archivos de respaldo se siguen haciendo en coche.<br>"
            },
            {
                "semana": "17",
                "title": "Redes Inalambricas",
                "data": "Tipos de redes inalámbricas<br> <br> Cobertura y estándares.<br> Según su cobertura, las redes inalámbricas se pueden clasificar en diferentes tipos:<br> <br> WPAN: Wireless Personal Area Network<br> Artículo principal: WPAN<br> En este tipo de red de cobertura personal, existen tecnologías basadas en HomeRF (estándar para conectar todos los teléfonos móviles de la casa y los ordenadores mediante un aparato central); Bluetooth (protocolo que sigue la especificación IEEE 802.15.1); ZigBee (basado en la especificación IEEE 802.15.4 y utilizado en aplicaciones como la domótica, que requieren comunicaciones seguras con tasas bajas de transmisión de datos y maximización de la vida útil de sus baterías, bajo consumo); RFID (sistema remoto de almacenamiento y recuperación de datos con el propósito de transmitir la identidad de un objeto) (similar a un número de serie único) mediante ondas de radio.<br> <br> Una Picnet es una red formada por dispositivos Móviles utilizando tecnología Bluetooth. Es una derivación de WPAN. Está formada por dos a siete dispositivos, la picnet sigue una estructura de maestro-esclavo donde el maestro es el que proporciona la conexión mediante un request que envía el esclavo. El maestro al establecer la conexión, define en que frecuencia va a trabajar.<br> <br> Tiene un alcance máximo de 10 metros y puede aumentar juntando varias piconets formando una Scatternet, donde un nodo esclavo hace a su vez el rol de un maestro proporcionado conexión más esclavos.<br> <br> El alcance típico de este tipo de redes es de unos cuantos metros, alrededor de los 10 metros máximo. La finalidad de estas redes es comunicar cualquier dispositivo personal (ordenador, terminal móvil, PDA, etc.) con sus periféricos, así como permitir una comunicación directa a corta distancia entre estos dispositivos.<br> <br> WLAN: Wireless Local Area Network<br> Véase también: Red de área local inalámbrica<br> Se encuentran tecnologías basadas en Wi-Fi, un estándar de comunicación inalámbrica basado en la norma IEEE 802.11. Puede presentar mejoras con respecto a la velocidad según sus estándares y alcanza una distancia de hasta 20 km.<br> <br> Utiliza Access Point para distribuir equipos de comunicación inalámbricos, y ese mismo forma una red inalámbrica que interconecta dispositivos móviles o tarjetas de red inalámbricas.<br> <br> WMAN: Wireless Metropolitan Area Network<br> Véase también: Red de área metropolitana<br> Para redes de área metropolitana se encuentran tecnologías basadas en WiMAX (Worldwide Interoperability for Microwave Access), es decir, Interoperabilidad Mundial para Acceso con Microondas, un estándar de comunicación inalámbrica basado en la norma IEEE 802.16. WiMAX es un protocolo parecido a Wi-Fi, pero con más cobertura y ancho de banda. También podemos encontrar otros sistemas de comunicación como LMDS (Local Multipoint Distribution Service).<br> <br> WWAN: Wireless Wide Area Network<br> Véase también: WAN<br> Una WWAN difiere de una WLAN (Wireless Local Area Network) en que usa tecnologías de red celular de comunicaciones móviles como WiMAX (aunque se aplica mejor a Redes WMAN), UMTS (Universal Mobile Telecommunications System), GPRS, EDGE, CDMA2000, GSM, CDPD, Mobitex, HSPA y 3G para transferir los datos. También incluye LMDS y Wi-Fi autónoma para conectar a internet.1​<br> <br> Tipos según el rango de frecuencias<br> Según el rango de frecuencias utilizado para transmitir, el medio de transmisión pueden ser las ondas de radio, las microondas terrestres o por satélite, y los infrarrojos, por ejemplo. Dependiendo del medio, la red inalámbrica tendrá unas características u otras:<br> <br> Microondas terrestres: se utilizan antenas parabólicas con un diámetro aproximado de unos tres metros. Tienen una cobertura de kilómetros, pero con el inconveniente de que el emisor y el receptor deben estar perfectamente alineados. Por eso, se acostumbran a utilizar en enlaces punto a punto en distancias cortas. En este caso, la atenuación producida por la lluvia es más importante ya que se opera a una frecuencia más elevada. Las microondas comprenden las frecuencias desde 1 hasta 300 GHz.<br> Microondas por satélite: se hacen enlaces entre dos o más estaciones terrestres que se denominan estaciones base. El satélite recibe la señal (denominada señal ascendente) en una banda de frecuencia, la amplifica y la retransmite en otra banda (señal descendente). Cada satélite opera en unas bandas concretas. Las fronteras frecuenciales de las microondas, tanto terrestres como por satélite, con los infrarrojos y las ondas de radio de alta frecuencia se mezclan bastante, así que pueden haber interferencias con las comunicaciones en determinadas frecuencias inalámbricas.<br> Infrarrojos: se enlazan transmisores y receptores que modulan la luz infrarroja no coherente. Deben estar alineados directamente o con una reflexión en una superficie. No pueden atravesar las paredes. Los infrarrojos van desde 300 GHz hasta 384 THz.<br> Aplicaciones<br> Las bandas más importantes con aplicaciones inalámbricas, del rango de frecuencias que abarcan las ondas de radio, son la VLF (comunicaciones en navegación y submarinos), LF (radio AM de onda larga), MF (radio AM de onda media), HF (radio AM de onda corta), VHF (radio FM y TV), UHF (TV).<br> Mediante las microondas terrestres, existen diferentes aplicaciones basadas en protocolos como Bluetooth o ZigBee para interconectar ordenadores portátiles, PDAs, teléfonos u otros aparatos. También se utilizan las microondas para comunicaciones con radares (detección de velocidad u otras características de objetos remotos) y para la televisión digital terrestre.<br> Las microondas por satélite se usan para la difusión de televisión por satélite, transmisión telefónica a larga distancia y en redes privadas, por ejemplo.<br> Los infrarrojos tienen aplicaciones como la comunicación a corta distancia de los ordenadores con sus periféricos. También se utilizan para mandos a distancia, ya que así no interfieren con otras señales electromagnéticas, por ejemplo la señal de televisión. Uno de los estándares más usados en estas comunicaciones es el IrDA (Infrared Data Association). Otros usos que tienen los infrarrojos son técnicas como la termografía, la cual permite determinar la temperatura (\"calor\") de objetos a distancia.<br> Seguridad<br> Para poder considerar una red inalámbrica como segura, debería cumplir con los siguientes requisitos:<br> <br> Las ondas de radio deben confinarse tanto como sea posible. Esto es difícil de lograr totalmente, pero se puede hacer un buen trabajo empleando antenas direccionales y configurando adecuadamente la potencia de transmisión de los puntos de acceso.<br> Debe existir algún mecanismo de autenticación en doble vía, que permita al cliente verificar que se está conectando a la red correcta, y a la red constatar que el cliente está autorizado para acceder a ella.<br> Los datos deben viajar cifrados por el aire, para evitar que equipos ajenos a la red puedan capturar datos mediante escucha pasiva.<br>"
            }
        ]
}